MMBytes/MultiGeiger-V2/sdkconfig.defaults.adafruit_esp32s3_tft_feather
# ============================================================================
# Adafruit ESP32-S3 TFT Feather (#5483) overlay — ESP32-S3 LX7 dual-core,
# 4 MB external QSPI flash, 2 MB external QSPI PSRAM (feathers3_d-class,
# NOT an in-package SiP), native USB-C. Onboard 240x135 ST7789 color TFT
# (see HAL_HAS_TFT / display_tft.c) — no I2C OLED on this board.
#
# NOT the "ESP32-S3 Reverse TFT Feather" (#5691) — a different board.
# Pin map, feature flags, and the full design rationale live in main/hal.h
# under BOARD_ADAFRUIT_ESP32S3_TFT_FEATHER and in
# docs/superpowers/specs/2026-07-10-adafruit-esp32s3-tft-feather-board-port-design.md
# ============================================================================

CONFIG_IDF_TARGET="esp32s3"

# 4 MB flash (product page spec).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Override the shared partitions.csv with the 4 MB layout (dual OTA, no
# factory partition — see partitions_4mb.csv's header comment). Same file
# already used by heltec_v2_4mb / sparkfun_thing_plus_esp32s3. OTA-slot
# headroom is NOT yet confirmed for this board — this is the first port
# that adds real new flash-resident driver code (esp_lcd + display_tft.c),
# unlike every prior port. Verify with a clean build before release
# (design spec §12 item 4).
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"

# External QSPI PSRAM, 2 MB, quad mode — same class as feathers3_d (not an
# in-package SiP like the R2/MINI-1 boards). 80 MHz to start; bench-verify
# and drop to CONFIG_SPIRAM_SPEED_40M if the boot log shows a PSRAM init
# failure (design spec §12 item 6).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Heap-spill policy and the V2.5.33 network/TLS PSRAM-offload knobs are
# identical across all PSRAM boards and live in the shared sdkconfig.defaults
# ("PSRAM heap policy" section).

# Console / flashing path: USB-Serial-JTAG (S3 built-in, no TinyUSB needed).
# `printf` and `ESP_LOGx` go to USB-C; `idf.py flash` uses the same port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Wi-Fi roaming app + other shared PSRAM-board config: see sdkconfig.defaults.psram
# (added to this board's SDKCONFIG_DEFAULTS in CMakeLists.txt).
